apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_i2c.h
/* I2C_SCL_FORCE_OUT : R/W; bitpos: [1]; default: 1;
 * 0: direct output; 1: open drain output.
 */

#define I2C_SCL_FORCE_OUT    (BIT(1))
#define I2C_SCL_FORCE_OUT_M  (I2C_SCL_FORCE_OUT_V << I2C_SCL_FORCE_OUT_S)
#define I2C_SCL_FORCE_OUT_V  0x00000001
#define I2C_SCL_FORCE_OUT_S  1

/* I2C_SDA_FORCE_OUT : R/W; bitpos: [0]; default: 1;
 * 0: direct output; 1: open drain output.
 */

#define I2C_SDA_FORCE_OUT    (BIT(0))
#define I2C_SDA_FORCE_OUT_M  (I2C_SDA_FORCE_OUT_V << I2C_SDA_FORCE_OUT_S)
#define I2C_SDA_FORCE_OUT_V  0x00000001
#define I2C_SDA_FORCE_OUT_S  0

/* I2C_SR_REG register
 * Describe I2C work status.
 */

#define I2C_SR_REG(i) (REG_I2C_BASE(i) + 0x8)

/* I2C_SCL_STATE_LAST : RO; bitpos: [30:28]; default: 0;
 * This field indicates the states of the state machine used to produce SCL.
 * 0: Idle; 1: Start; 2: Negative edge; 3: Low; 4: Positive edge; 5: High;
 * 6: Stop
 */

#define I2C_SCL_STATE_LAST    0x00000007
#define I2C_SCL_STATE_LAST_M  (I2C_SCL_STATE_LAST_V << I2C_SCL_STATE_LAST_S)
#define I2C_SCL_STATE_LAST_V  0x00000007
#define I2C_SCL_STATE_LAST_S  28

/* I2C_SCL_MAIN_STATE_LAST : RO; bitpos: [26:24]; default: 0;
 * This field indicates the states of the I2C module state machine.
 * 0: Idle; 1: Address shift; 2: ACK address; 3: Rx data; 4: Tx data; 5:
 * Send ACK; 6: Wait ACK
 */

#define I2C_SCL_MAIN_STATE_LAST    0x00000007
#define I2C_SCL_MAIN_STATE_LAST_M  (I2C_SCL_MAIN_STATE_LAST_V << I2C_SCL_MAIN_STATE_LAST_S)
#define I2C_SCL_MAIN_STATE_LAST_V  0x00000007
#define I2C_SCL_MAIN_STATE_LAST_S  24

/* I2C_TXFIFO_CNT : RO; bitpos: [23:18]; default: 0;
 * This field stores the amount of received data in RAM.
 */

#define I2C_TXFIFO_CNT    0x0000003f
#define I2C_TXFIFO_CNT_M  (I2C_TXFIFO_CNT_V << I2C_TXFIFO_CNT_S)
#define I2C_TXFIFO_CNT_V  0x0000003f
#define I2C_TXFIFO_CNT_S  18

/* I2C_STRETCH_CAUSE : RO; bitpos: [15:14]; default: 3;
 * The cause of stretching SCL low in slave mode. 0:  stretching SCL low at
 * the beginning of I2C read data state. 1: stretching SCL low when I2C Tx
 * FIFO is empty in slave mode. 2: stretching SCL low when I2C Rx FIFO is
 * full in slave mode.
 */

#define I2C_STRETCH_CAUSE    0x00000003
#define I2C_STRETCH_CAUSE_M  (I2C_STRETCH_CAUSE_V << I2C_STRETCH_CAUSE_S)
#define I2C_STRETCH_CAUSE_V  0x00000003
#define I2C_STRETCH_CAUSE_S  14

/* I2C_RXFIFO_CNT : RO; bitpos: [13:8]; default: 0;
 * This field represents the amount of data needed to be sent.
 */

#define I2C_RXFIFO_CNT    0x0000003f
#define I2C_RXFIFO_CNT_M  (I2C_RXFIFO_CNT_V << I2C_RXFIFO_CNT_S)
#define I2C_RXFIFO_CNT_V  0x0000003f
#define I2C_RXFIFO_CNT_S  8

/* I2C_SLAVE_ADDRESSED : RO; bitpos: [5]; default: 0;
 * When configured as an I2C Slave, and the address sent by the master is
 * equal to the address of the slave, then this bit will be of high level.
 */

#define I2C_SLAVE_ADDRESSED    (BIT(5))
#define I2C_SLAVE_ADDRESSED_M  (I2C_SLAVE_ADDRESSED_V << I2C_SLAVE_ADDRESSED_S)
#define I2C_SLAVE_ADDRESSED_V  0x00000001
#define I2C_SLAVE_ADDRESSED_S  5

/* I2C_BUS_BUSY : RO; bitpos: [4]; default: 0;
 * 1: the I2C bus is busy transferring data; 0: the I2C bus is in idle state.
 */

#define I2C_BUS_BUSY    (BIT(4))
#define I2C_BUS_BUSY_M  (I2C_BUS_BUSY_V << I2C_BUS_BUSY_S)
#define I2C_BUS_BUSY_V  0x00000001
#define I2C_BUS_BUSY_S  4

/* I2C_ARB_LOST : RO; bitpos: [3]; default: 0;
 * When the I2C controller loses control of SCL line, this register changes
 * to 1.
 */

#define I2C_ARB_LOST    (BIT(3))
#define I2C_ARB_LOST_M  (I2C_ARB_LOST_V << I2C_ARB_LOST_S)
#define I2C_ARB_LOST_V  0x00000001
#define I2C_ARB_LOST_S  3

/* I2C_SLAVE_RW : RO; bitpos: [1]; default: 0;
 * When in slave mode, 1: master reads from slave; 0: master writes to slave.
 */

#define I2C_SLAVE_RW    (BIT(1))
#define I2C_SLAVE_RW_M  (I2C_SLAVE_RW_V << I2C_SLAVE_RW_S)
#define I2C_SLAVE_RW_V  0x00000001
#define I2C_SLAVE_RW_S  1

/* I2C_RESP_REC : RO; bitpos: [0]; default: 0;
 * The received ACK value in master mode or slave mode. 0: ACK, 1: NACK.
 */

#define I2C_RESP_REC    (BIT(0))
#define I2C_RESP_REC_M  (I2C_RESP_REC_V << I2C_RESP_REC_S)
#define I2C_RESP_REC_V  0x00000001
#define I2C_RESP_REC_S  0

/* I2C_TO_REG register
 * Setting time out control for receiving data.
 */

#define I2C_TO_REG(i) (REG_I2C_BASE(i) + 0xc)

/* I2C_TIME_OUT_EN : R/W; bitpos: [5]; default: 0;
 * This is the enable bit for time out control.
 */

#define I2C_TIME_OUT_EN    (BIT(5))
#define I2C_TIME_OUT_EN_M  (I2C_TIME_OUT_EN_V << I2C_TIME_OUT_EN_S)
#define I2C_TIME_OUT_EN_V  0x00000001
#define I2C_TIME_OUT_EN_S  5

/* I2C_TIME_OUT_VALUE : R/W; bitpos: [4:0]; default: 16;
 * This register is used to configure the timeout for receiving a data bit
 * in APB
 * clock cycles.
 */

#define I2C_TIME_OUT_VALUE    0x0000001f
#define I2C_TIME_OUT_VALUE_M  (I2C_TIME_OUT_VALUE_V << I2C_TIME_OUT_VALUE_S)
#define I2C_TIME_OUT_VALUE_V  0x0000001f
#define I2C_TIME_OUT_VALUE_S  0

/* I2C_SLAVE_ADDR_REG register
 * Local slave address setting
 */

#define I2C_SLAVE_ADDR_REG(i) (REG_I2C_BASE(i) + 0x10)

/* I2C_ADDR_10BIT_EN : R/W; bitpos: [31]; default: 0;
 * This field is used to enable the slave 10-bit addressing mode in master
 * mode.
 */

#define I2C_ADDR_10BIT_EN    (BIT(31))
#define I2C_ADDR_10BIT_EN_M  (I2C_ADDR_10BIT_EN_V << I2C_ADDR_10BIT_EN_S)
#define I2C_ADDR_10BIT_EN_V  0x00000001
#define I2C_ADDR_10BIT_EN_S  31

/* I2C_SLAVE_ADDR : R/W; bitpos: [14:0]; default: 0;
 * When configured as an I2C Slave, this field is used to configure the
 * slave address.
 */

#define I2C_SLAVE_ADDR    0x00007fff
#define I2C_SLAVE_ADDR_M  (I2C_SLAVE_ADDR_V << I2C_SLAVE_ADDR_S)
#define I2C_SLAVE_ADDR_V  0x00007fff
#define I2C_SLAVE_ADDR_S  0

/* I2C_FIFO_ST_REG register
 * FIFO status register.
 */

#define I2C_FIFO_ST_REG(i) (REG_I2C_BASE(i) + 0x14)

/* I2C_SLAVE_RW_POINT : RO; bitpos: [29:22]; default: 0;
 * The received data in I2C slave mode.
 */

#define I2C_SLAVE_RW_POINT    0x000000ff
#define I2C_SLAVE_RW_POINT_M  (I2C_SLAVE_RW_POINT_V << I2C_SLAVE_RW_POINT_S)
#define I2C_SLAVE_RW_POINT_V  0x000000ff
#define I2C_SLAVE_RW_POINT_S  22

/* I2C_TXFIFO_WADDR : RO; bitpos: [19:15]; default: 0;
 * This is the offset address of APB bus writing to txfifo.
 */

#define I2C_TXFIFO_WADDR    0x0000001f
#define I2C_TXFIFO_WADDR_M  (I2C_TXFIFO_WADDR_V << I2C_TXFIFO_WADDR_S)
#define I2C_TXFIFO_WADDR_V  0x0000001f
#define I2C_TXFIFO_WADDR_S  15

/* I2C_TXFIFO_RADDR : RO; bitpos: [14:10]; default: 0;
 * This is the offset address of i2c module reading from txfifo.
 */

#define I2C_TXFIFO_RADDR    0x0000001f
#define I2C_TXFIFO_RADDR_M  (I2C_TXFIFO_RADDR_V << I2C_TXFIFO_RADDR_S)
#define I2C_TXFIFO_RADDR_V  0x0000001f
#define I2C_TXFIFO_RADDR_S  10

