apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_i2c.h
/* I2C_RXFIFO_WADDR : RO; bitpos: [9:5]; default: 0;
 * This is the offset address of i2c module receiving data and writing to
 * rxfifo.
 */

#define I2C_RXFIFO_WADDR    0x0000001f
#define I2C_RXFIFO_WADDR_M  (I2C_RXFIFO_WADDR_V << I2C_RXFIFO_WADDR_S)
#define I2C_RXFIFO_WADDR_V  0x0000001f
#define I2C_RXFIFO_WADDR_S  5

/* I2C_RXFIFO_RADDR : RO; bitpos: [4:0]; default: 0;
 * This is the offset address of the APB reading from rxfifo
 */

#define I2C_RXFIFO_RADDR    0x0000001f
#define I2C_RXFIFO_RADDR_M  (I2C_RXFIFO_RADDR_V << I2C_RXFIFO_RADDR_S)
#define I2C_RXFIFO_RADDR_V  0x0000001f
#define I2C_RXFIFO_RADDR_S  0

/* I2C_FIFO_CONF_REG register
 * FIFO configuration register.
 */

#define I2C_FIFO_CONF_REG(i) (REG_I2C_BASE(i) + 0x18)

/* I2C_FIFO_PRT_EN : R/W; bitpos: [14]; default: 1;
 * The control enable bit of FIFO pointer in non-fifo access mode. This bit
 * controls the valid bits and the interrupts of tx/rx_fifo overflow,
 * underflow, full and empty.
 */

#define I2C_FIFO_PRT_EN    (BIT(14))
#define I2C_FIFO_PRT_EN_M  (I2C_FIFO_PRT_EN_V << I2C_FIFO_PRT_EN_S)
#define I2C_FIFO_PRT_EN_V  0x00000001
#define I2C_FIFO_PRT_EN_S  14

/* I2C_TX_FIFO_RST : R/W; bitpos: [13]; default: 0;
 * Set this bit to reset tx-fifo.
 */

#define I2C_TX_FIFO_RST    (BIT(13))
#define I2C_TX_FIFO_RST_M  (I2C_TX_FIFO_RST_V << I2C_TX_FIFO_RST_S)
#define I2C_TX_FIFO_RST_V  0x00000001
#define I2C_TX_FIFO_RST_S  13

/* I2C_RX_FIFO_RST : R/W; bitpos: [12]; default: 0;
 * Set this bit to reset rx-fifo.
 */

#define I2C_RX_FIFO_RST    (BIT(12))
#define I2C_RX_FIFO_RST_M  (I2C_RX_FIFO_RST_V << I2C_RX_FIFO_RST_S)
#define I2C_RX_FIFO_RST_V  0x00000001
#define I2C_RX_FIFO_RST_S  12

/* I2C_FIFO_ADDR_CFG_EN : R/W; bitpos: [11]; default: 0;
 * When this bit is set to 1, the byte received after the I2C address byte
 * represents the offset address in the I2C Slave RAM.
 */

#define I2C_FIFO_ADDR_CFG_EN    (BIT(11))
#define I2C_FIFO_ADDR_CFG_EN_M  (I2C_FIFO_ADDR_CFG_EN_V << I2C_FIFO_ADDR_CFG_EN_S)
#define I2C_FIFO_ADDR_CFG_EN_V  0x00000001
#define I2C_FIFO_ADDR_CFG_EN_S  11

/* I2C_NONFIFO_EN : R/W; bitpos: [10]; default: 0;
 * Set this bit to enable APB nonfifo access.
 */

#define I2C_NONFIFO_EN    (BIT(10))
#define I2C_NONFIFO_EN_M  (I2C_NONFIFO_EN_V << I2C_NONFIFO_EN_S)
#define I2C_NONFIFO_EN_V  0x00000001
#define I2C_NONFIFO_EN_S  10

/* I2C_TXFIFO_WM_THRHD : R/W; bitpos: [9:5]; default: 4;
 * The water mark threshold of tx FIFO in nonfifo access mode. When
 * reg_reg_fifo_prt_en is 1 and tx FIFO counter is smaller than
 * reg_txfifo_wm_thrhd[4:0], reg_txfifo_wm_int_raw bit will be valid.
 */

#define I2C_TXFIFO_WM_THRHD    0x0000001f
#define I2C_TXFIFO_WM_THRHD_M  (I2C_TXFIFO_WM_THRHD_V << I2C_TXFIFO_WM_THRHD_S)
#define I2C_TXFIFO_WM_THRHD_V  0x0000001f
#define I2C_TXFIFO_WM_THRHD_S  5

/* I2C_RXFIFO_WM_THRHD : R/W; bitpos: [4:0]; default: 11;
 * The water mark threshold of rx FIFO in nonfifo access mode. When
 * reg_reg_fifo_prt_en is 1 and rx FIFO counter is bigger than
 * reg_rxfifo_wm_thrhd[4:0], reg_rxfifo_wm_int_raw bit will be valid.
 */

#define I2C_RXFIFO_WM_THRHD    0x0000001f
#define I2C_RXFIFO_WM_THRHD_M  (I2C_RXFIFO_WM_THRHD_V << I2C_RXFIFO_WM_THRHD_S)
#define I2C_RXFIFO_WM_THRHD_V  0x0000001f
#define I2C_RXFIFO_WM_THRHD_S  0

/* I2C_DATA_REG register
 * Rx FIFO read data.
 */

#define I2C_DATA_REG(i) (REG_I2C_BASE(i) + 0x1c)

/* I2C_FIFO_RDATA : RO; bitpos: [7:0]; default: 0;
 * The value of rx FIFO read data.
 */

#define I2C_FIFO_RDATA    0x000000ff
#define I2C_FIFO_RDATA_M  (I2C_FIFO_RDATA_V << I2C_FIFO_RDATA_S)
#define I2C_FIFO_RDATA_V  0x000000ff
#define I2C_FIFO_RDATA_S  0

/* I2C_INT_RAW_REG register
 * Raw interrupt status
 */

#define I2C_INT_RAW_REG(i) (REG_I2C_BASE(i) + 0x20)

/* I2C_GENERAL_CALL_INT_RAW : R/SS/WTC; bitpos: [17]; default: 0;
 * The raw interrupt bit for I2C_GENARAL_CALL_INT interrupt.
 */

#define I2C_GENERAL_CALL_INT_RAW    (BIT(17))
#define I2C_GENERAL_CALL_INT_RAW_M  (I2C_GENERAL_CALL_INT_RAW_V << I2C_GENERAL_CALL_INT_RAW_S)
#define I2C_GENERAL_CALL_INT_RAW_V  0x00000001
#define I2C_GENERAL_CALL_INT_RAW_S  17

/* I2C_SLAVE_STRETCH_INT_RAW : R/SS/WTC; bitpos: [16]; default: 0;
 * The raw interrupt bit for I2C_SLAVE_STRETCH_INT interrupt.
 */

#define I2C_SLAVE_STRETCH_INT_RAW    (BIT(16))
#define I2C_SLAVE_STRETCH_INT_RAW_M  (I2C_SLAVE_STRETCH_INT_RAW_V << I2C_SLAVE_STRETCH_INT_RAW_S)
#define I2C_SLAVE_STRETCH_INT_RAW_V  0x00000001
#define I2C_SLAVE_STRETCH_INT_RAW_S  16

/* I2C_DET_START_INT_RAW : R/SS/WTC; bitpos: [15]; default: 0;
 * The raw interrupt bit for I2C_DET_START_INT interrupt.
 */

#define I2C_DET_START_INT_RAW    (BIT(15))
#define I2C_DET_START_INT_RAW_M  (I2C_DET_START_INT_RAW_V << I2C_DET_START_INT_RAW_S)
#define I2C_DET_START_INT_RAW_V  0x00000001
#define I2C_DET_START_INT_RAW_S  15

/* I2C_SCL_MAIN_ST_TO_INT_RAW : R/SS/WTC; bitpos: [14]; default: 0;
 * The raw interrupt bit for I2C_SCL_MAIN_ST_TO_INT interrupt.
 */

#define I2C_SCL_MAIN_ST_TO_INT_RAW    (BIT(14))
#define I2C_SCL_MAIN_ST_TO_INT_RAW_M  (I2C_SCL_MAIN_ST_TO_INT_RAW_V << I2C_SCL_MAIN_ST_TO_INT_RAW_S)
#define I2C_SCL_MAIN_ST_TO_INT_RAW_V  0x00000001
#define I2C_SCL_MAIN_ST_TO_INT_RAW_S  14

/* I2C_SCL_ST_TO_INT_RAW : R/SS/WTC; bitpos: [13]; default: 0;
 * The raw interrupt bit for I2C_SCL_ST_TO_INT interrupt.
 */

#define I2C_SCL_ST_TO_INT_RAW    (BIT(13))
#define I2C_SCL_ST_TO_INT_RAW_M  (I2C_SCL_ST_TO_INT_RAW_V << I2C_SCL_ST_TO_INT_RAW_S)
#define I2C_SCL_ST_TO_INT_RAW_V  0x00000001
#define I2C_SCL_ST_TO_INT_RAW_S  13

/* I2C_RXFIFO_UDF_INT_RAW : R/SS/WTC; bitpos: [12]; default: 0;
 * The raw interrupt bit for I2C_RXFIFO_UDF_INT  interrupt.
 */

#define I2C_RXFIFO_UDF_INT_RAW    (BIT(12))
#define I2C_RXFIFO_UDF_INT_RAW_M  (I2C_RXFIFO_UDF_INT_RAW_V << I2C_RXFIFO_UDF_INT_RAW_S)
#define I2C_RXFIFO_UDF_INT_RAW_V  0x00000001
#define I2C_RXFIFO_UDF_INT_RAW_S  12

/* I2C_TXFIFO_OVF_INT_RAW : R/SS/WTC; bitpos: [11]; default: 0;
 * The raw interrupt bit for I2C_TXFIFO_OVF_INT interrupt.
 */

#define I2C_TXFIFO_OVF_INT_RAW    (BIT(11))
#define I2C_TXFIFO_OVF_INT_RAW_M  (I2C_TXFIFO_OVF_INT_RAW_V << I2C_TXFIFO_OVF_INT_RAW_S)
#define I2C_TXFIFO_OVF_INT_RAW_V  0x00000001
#define I2C_TXFIFO_OVF_INT_RAW_S  11

