apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_i2c.h
/* I2C_TXFIFO_OVF_INT_CLR : WT; bitpos: [11]; default: 0;
 * Set this bit to clear I2C_TXFIFO_OVF_INT interrupt.
 */

#define I2C_TXFIFO_OVF_INT_CLR    (BIT(11))
#define I2C_TXFIFO_OVF_INT_CLR_M  (I2C_TXFIFO_OVF_INT_CLR_V << I2C_TXFIFO_OVF_INT_CLR_S)
#define I2C_TXFIFO_OVF_INT_CLR_V  0x00000001
#define I2C_TXFIFO_OVF_INT_CLR_S  11

/* I2C_NACK_INT_CLR : WT; bitpos: [10]; default: 0;
 * Set this bit to clear I2C_SLAVE_STRETCH_INT interrupt.
 */

#define I2C_NACK_INT_CLR    (BIT(10))
#define I2C_NACK_INT_CLR_M  (I2C_NACK_INT_CLR_V << I2C_NACK_INT_CLR_S)
#define I2C_NACK_INT_CLR_V  0x00000001
#define I2C_NACK_INT_CLR_S  10

/* I2C_TRANS_START_INT_CLR : WT; bitpos: [9]; default: 0;
 * Set this bit to clear the I2C_TRANS_START_INT interrupt.
 */

#define I2C_TRANS_START_INT_CLR    (BIT(9))
#define I2C_TRANS_START_INT_CLR_M  (I2C_TRANS_START_INT_CLR_V << I2C_TRANS_START_INT_CLR_S)
#define I2C_TRANS_START_INT_CLR_V  0x00000001
#define I2C_TRANS_START_INT_CLR_S  9

/* I2C_TIME_OUT_INT_CLR : WT; bitpos: [8]; default: 0;
 * Set this bit to clear the I2C_TIME_OUT_INT interrupt.
 */

#define I2C_TIME_OUT_INT_CLR    (BIT(8))
#define I2C_TIME_OUT_INT_CLR_M  (I2C_TIME_OUT_INT_CLR_V << I2C_TIME_OUT_INT_CLR_S)
#define I2C_TIME_OUT_INT_CLR_V  0x00000001
#define I2C_TIME_OUT_INT_CLR_S  8

/* I2C_TRANS_COMPLETE_INT_CLR : WT; bitpos: [7]; default: 0;
 * Set this bit to clear the I2C_TRANS_COMPLETE_INT interrupt.
 */

#define I2C_TRANS_COMPLETE_INT_CLR    (BIT(7))
#define I2C_TRANS_COMPLETE_INT_CLR_M  (I2C_TRANS_COMPLETE_INT_CLR_V << I2C_TRANS_COMPLETE_INT_CLR_S)
#define I2C_TRANS_COMPLETE_INT_CLR_V  0x00000001
#define I2C_TRANS_COMPLETE_INT_CLR_S  7

/* I2C_MST_TXFIFO_UDF_INT_CLR : WT; bitpos: [6]; default: 0;
 * Set this bit to clear I2C_TRANS_COMPLETE_INT interrupt.
 */

#define I2C_MST_TXFIFO_UDF_INT_CLR    (BIT(6))
#define I2C_MST_TXFIFO_UDF_INT_CLR_M  (I2C_MST_TXFIFO_UDF_INT_CLR_V << I2C_MST_TXFIFO_UDF_INT_CLR_S)
#define I2C_MST_TXFIFO_UDF_INT_CLR_V  0x00000001
#define I2C_MST_TXFIFO_UDF_INT_CLR_S  6

/* I2C_ARBITRATION_LOST_INT_CLR : WT; bitpos: [5]; default: 0;
 * Set this bit to clear the I2C_ARBITRATION_LOST_INT interrupt.
 */

#define I2C_ARBITRATION_LOST_INT_CLR    (BIT(5))
#define I2C_ARBITRATION_LOST_INT_CLR_M  (I2C_ARBITRATION_LOST_INT_CLR_V << I2C_ARBITRATION_LOST_INT_CLR_S)
#define I2C_ARBITRATION_LOST_INT_CLR_V  0x00000001
#define I2C_ARBITRATION_LOST_INT_CLR_S  5

/* I2C_BYTE_TRANS_DONE_INT_CLR : WT; bitpos: [4]; default: 0;
 * Set this bit to clear the I2C_END_DETECT_INT interrupt.
 */

#define I2C_BYTE_TRANS_DONE_INT_CLR    (BIT(4))
#define I2C_BYTE_TRANS_DONE_INT_CLR_M  (I2C_BYTE_TRANS_DONE_INT_CLR_V << I2C_BYTE_TRANS_DONE_INT_CLR_S)
#define I2C_BYTE_TRANS_DONE_INT_CLR_V  0x00000001
#define I2C_BYTE_TRANS_DONE_INT_CLR_S  4

/* I2C_END_DETECT_INT_CLR : WT; bitpos: [3]; default: 0;
 * Set this bit to clear the I2C_END_DETECT_INT interrupt.
 */

#define I2C_END_DETECT_INT_CLR    (BIT(3))
#define I2C_END_DETECT_INT_CLR_M  (I2C_END_DETECT_INT_CLR_V << I2C_END_DETECT_INT_CLR_S)
#define I2C_END_DETECT_INT_CLR_V  0x00000001
#define I2C_END_DETECT_INT_CLR_S  3

/* I2C_RXFIFO_OVF_INT_CLR : WT; bitpos: [2]; default: 0;
 * Set this bit to clear I2C_RXFIFO_OVF_INT interrupt.
 */

#define I2C_RXFIFO_OVF_INT_CLR    (BIT(2))
#define I2C_RXFIFO_OVF_INT_CLR_M  (I2C_RXFIFO_OVF_INT_CLR_V << I2C_RXFIFO_OVF_INT_CLR_S)
#define I2C_RXFIFO_OVF_INT_CLR_V  0x00000001
#define I2C_RXFIFO_OVF_INT_CLR_S  2

/* I2C_TXFIFO_WM_INT_CLR : WT; bitpos: [1]; default: 0;
 * Set this bit to clear I2C_TXFIFO_WM_INT interrupt.
 */

#define I2C_TXFIFO_WM_INT_CLR    (BIT(1))
#define I2C_TXFIFO_WM_INT_CLR_M  (I2C_TXFIFO_WM_INT_CLR_V << I2C_TXFIFO_WM_INT_CLR_S)
#define I2C_TXFIFO_WM_INT_CLR_V  0x00000001
#define I2C_TXFIFO_WM_INT_CLR_S  1

/* I2C_RXFIFO_WM_INT_CLR : WT; bitpos: [0]; default: 0;
 * Set this bit to clear I2C_RXFIFO_WM_INT interrupt.
 */

#define I2C_RXFIFO_WM_INT_CLR    (BIT(0))
#define I2C_RXFIFO_WM_INT_CLR_M  (I2C_RXFIFO_WM_INT_CLR_V << I2C_RXFIFO_WM_INT_CLR_S)
#define I2C_RXFIFO_WM_INT_CLR_V  0x00000001
#define I2C_RXFIFO_WM_INT_CLR_S  0

/* I2C_INT_ENA_REG register
 * Interrupt enable bits
 */

#define I2C_INT_ENA_REG(i) (REG_I2C_BASE(i) + 0x28)

/* I2C_GENERAL_CALL_INT_ENA : R/W; bitpos: [17]; default: 0;
 * The interrupt enable bit for I2C_GENARAL_CALL_INT interrupt.
 */

#define I2C_GENERAL_CALL_INT_ENA    (BIT(17))
#define I2C_GENERAL_CALL_INT_ENA_M  (I2C_GENERAL_CALL_INT_ENA_V << I2C_GENERAL_CALL_INT_ENA_S)
#define I2C_GENERAL_CALL_INT_ENA_V  0x00000001
#define I2C_GENERAL_CALL_INT_ENA_S  17

/* I2C_SLAVE_STRETCH_INT_ENA : R/W; bitpos: [16]; default: 0;
 * The interrupt enable bit for I2C_SLAVE_STRETCH_INT interrupt.
 */

#define I2C_SLAVE_STRETCH_INT_ENA    (BIT(16))
#define I2C_SLAVE_STRETCH_INT_ENA_M  (I2C_SLAVE_STRETCH_INT_ENA_V << I2C_SLAVE_STRETCH_INT_ENA_S)
#define I2C_SLAVE_STRETCH_INT_ENA_V  0x00000001
#define I2C_SLAVE_STRETCH_INT_ENA_S  16

/* I2C_DET_START_INT_ENA : R/W; bitpos: [15]; default: 0;
 * The interrupt enable bit for I2C_DET_START_INT interrupt.
 */

#define I2C_DET_START_INT_ENA    (BIT(15))
#define I2C_DET_START_INT_ENA_M  (I2C_DET_START_INT_ENA_V << I2C_DET_START_INT_ENA_S)
#define I2C_DET_START_INT_ENA_V  0x00000001
#define I2C_DET_START_INT_ENA_S  15

/* I2C_SCL_MAIN_ST_TO_INT_ENA : R/W; bitpos: [14]; default: 0;
 * The interrupt enable bit for I2C_SCL_MAIN_ST_TO_INT interrupt.
 */

#define I2C_SCL_MAIN_ST_TO_INT_ENA    (BIT(14))
#define I2C_SCL_MAIN_ST_TO_INT_ENA_M  (I2C_SCL_MAIN_ST_TO_INT_ENA_V << I2C_SCL_MAIN_ST_TO_INT_ENA_S)
#define I2C_SCL_MAIN_ST_TO_INT_ENA_V  0x00000001
#define I2C_SCL_MAIN_ST_TO_INT_ENA_S  14

/* I2C_SCL_ST_TO_INT_ENA : R/W; bitpos: [13]; default: 0;
 * The interrupt enable bit for I2C_SCL_ST_TO_INT interrupt.
 */

#define I2C_SCL_ST_TO_INT_ENA    (BIT(13))
#define I2C_SCL_ST_TO_INT_ENA_M  (I2C_SCL_ST_TO_INT_ENA_V << I2C_SCL_ST_TO_INT_ENA_S)
#define I2C_SCL_ST_TO_INT_ENA_V  0x00000001
#define I2C_SCL_ST_TO_INT_ENA_S  13

/* I2C_RXFIFO_UDF_INT_ENA : R/W; bitpos: [12]; default: 0;
 * The interrupt enable bit for I2C_RXFIFO_UDF_INT  interrupt.
 */

#define I2C_RXFIFO_UDF_INT_ENA    (BIT(12))
#define I2C_RXFIFO_UDF_INT_ENA_M  (I2C_RXFIFO_UDF_INT_ENA_V << I2C_RXFIFO_UDF_INT_ENA_S)
#define I2C_RXFIFO_UDF_INT_ENA_V  0x00000001
#define I2C_RXFIFO_UDF_INT_ENA_S  12

