apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_i2c.h
/* I2C_TXFIFO_OVF_INT_ST : RO; bitpos: [11]; default: 0;
 * The masked interrupt status bit for I2C_TXFIFO_OVF_INT interrupt.
 */

#define I2C_TXFIFO_OVF_INT_ST    (BIT(11))
#define I2C_TXFIFO_OVF_INT_ST_M  (I2C_TXFIFO_OVF_INT_ST_V << I2C_TXFIFO_OVF_INT_ST_S)
#define I2C_TXFIFO_OVF_INT_ST_V  0x00000001
#define I2C_TXFIFO_OVF_INT_ST_S  11

/* I2C_NACK_INT_ST : RO; bitpos: [10]; default: 0;
 * The masked interrupt status bit for I2C_SLAVE_STRETCH_INT interrupt.
 */

#define I2C_NACK_INT_ST    (BIT(10))
#define I2C_NACK_INT_ST_M  (I2C_NACK_INT_ST_V << I2C_NACK_INT_ST_S)
#define I2C_NACK_INT_ST_V  0x00000001
#define I2C_NACK_INT_ST_S  10

/* I2C_TRANS_START_INT_ST : RO; bitpos: [9]; default: 0;
 * The masked interrupt status bit for the I2C_TRANS_START_INT interrupt.
 */

#define I2C_TRANS_START_INT_ST    (BIT(9))
#define I2C_TRANS_START_INT_ST_M  (I2C_TRANS_START_INT_ST_V << I2C_TRANS_START_INT_ST_S)
#define I2C_TRANS_START_INT_ST_V  0x00000001
#define I2C_TRANS_START_INT_ST_S  9

/* I2C_TIME_OUT_INT_ST : RO; bitpos: [8]; default: 0;
 * The masked interrupt status bit for the I2C_TIME_OUT_INT interrupt.
 */

#define I2C_TIME_OUT_INT_ST    (BIT(8))
#define I2C_TIME_OUT_INT_ST_M  (I2C_TIME_OUT_INT_ST_V << I2C_TIME_OUT_INT_ST_S)
#define I2C_TIME_OUT_INT_ST_V  0x00000001
#define I2C_TIME_OUT_INT_ST_S  8

/* I2C_TRANS_COMPLETE_INT_ST : RO; bitpos: [7]; default: 0;
 * The masked interrupt status bit for the I2C_TRANS_COMPLETE_INT interrupt.
 */

#define I2C_TRANS_COMPLETE_INT_ST    (BIT(7))
#define I2C_TRANS_COMPLETE_INT_ST_M  (I2C_TRANS_COMPLETE_INT_ST_V << I2C_TRANS_COMPLETE_INT_ST_S)
#define I2C_TRANS_COMPLETE_INT_ST_V  0x00000001
#define I2C_TRANS_COMPLETE_INT_ST_S  7

/* I2C_MST_TXFIFO_UDF_INT_ST : RO; bitpos: [6]; default: 0;
 * The masked interrupt status bit for I2C_TRANS_COMPLETE_INT interrupt.
 */

#define I2C_MST_TXFIFO_UDF_INT_ST    (BIT(6))
#define I2C_MST_TXFIFO_UDF_INT_ST_M  (I2C_MST_TXFIFO_UDF_INT_ST_V << I2C_MST_TXFIFO_UDF_INT_ST_S)
#define I2C_MST_TXFIFO_UDF_INT_ST_V  0x00000001
#define I2C_MST_TXFIFO_UDF_INT_ST_S  6

/* I2C_ARBITRATION_LOST_INT_ST : RO; bitpos: [5]; default: 0;
 * The masked interrupt status bit for the I2C_ARBITRATION_LOST_INT
 * interrupt.
 */

#define I2C_ARBITRATION_LOST_INT_ST    (BIT(5))
#define I2C_ARBITRATION_LOST_INT_ST_M  (I2C_ARBITRATION_LOST_INT_ST_V << I2C_ARBITRATION_LOST_INT_ST_S)
#define I2C_ARBITRATION_LOST_INT_ST_V  0x00000001
#define I2C_ARBITRATION_LOST_INT_ST_S  5

/* I2C_BYTE_TRANS_DONE_INT_ST : RO; bitpos: [4]; default: 0;
 * The masked interrupt status bit for the I2C_END_DETECT_INT interrupt.
 */

#define I2C_BYTE_TRANS_DONE_INT_ST    (BIT(4))
#define I2C_BYTE_TRANS_DONE_INT_ST_M  (I2C_BYTE_TRANS_DONE_INT_ST_V << I2C_BYTE_TRANS_DONE_INT_ST_S)
#define I2C_BYTE_TRANS_DONE_INT_ST_V  0x00000001
#define I2C_BYTE_TRANS_DONE_INT_ST_S  4

/* I2C_END_DETECT_INT_ST : RO; bitpos: [3]; default: 0;
 * The masked interrupt status bit for the I2C_END_DETECT_INT interrupt.
 */

#define I2C_END_DETECT_INT_ST    (BIT(3))
#define I2C_END_DETECT_INT_ST_M  (I2C_END_DETECT_INT_ST_V << I2C_END_DETECT_INT_ST_S)
#define I2C_END_DETECT_INT_ST_V  0x00000001
#define I2C_END_DETECT_INT_ST_S  3

/* I2C_RXFIFO_OVF_INT_ST : RO; bitpos: [2]; default: 0;
 * The masked interrupt status bit for I2C_RXFIFO_OVF_INT interrupt.
 */

#define I2C_RXFIFO_OVF_INT_ST    (BIT(2))
#define I2C_RXFIFO_OVF_INT_ST_M  (I2C_RXFIFO_OVF_INT_ST_V << I2C_RXFIFO_OVF_INT_ST_S)
#define I2C_RXFIFO_OVF_INT_ST_V  0x00000001
#define I2C_RXFIFO_OVF_INT_ST_S  2

/* I2C_TXFIFO_WM_INT_ST : RO; bitpos: [1]; default: 0;
 * The masked interrupt status bit for I2C_TXFIFO_WM_INT interrupt.
 */

#define I2C_TXFIFO_WM_INT_ST    (BIT(1))
#define I2C_TXFIFO_WM_INT_ST_M  (I2C_TXFIFO_WM_INT_ST_V << I2C_TXFIFO_WM_INT_ST_S)
#define I2C_TXFIFO_WM_INT_ST_V  0x00000001
#define I2C_TXFIFO_WM_INT_ST_S  1

/* I2C_RXFIFO_WM_INT_ST : RO; bitpos: [0]; default: 0;
 * The masked interrupt status bit for I2C_RXFIFO_WM_INT interrupt.
 */

#define I2C_RXFIFO_WM_INT_ST    (BIT(0))
#define I2C_RXFIFO_WM_INT_ST_M  (I2C_RXFIFO_WM_INT_ST_V << I2C_RXFIFO_WM_INT_ST_S)
#define I2C_RXFIFO_WM_INT_ST_V  0x00000001
#define I2C_RXFIFO_WM_INT_ST_S  0

/* I2C_SDA_HOLD_REG register
 * Configures the hold time after a negative SCL edge.
 */

#define I2C_SDA_HOLD_REG(i) (REG_I2C_BASE(i) + 0x30)

/* I2C_SDA_HOLD_TIME : R/W; bitpos: [8:0]; default: 0;
 * This register is used to configure the time to hold the data after the
 * negative
 * edge of SCL, in I2C module clock cycles.
 */

#define I2C_SDA_HOLD_TIME    0x000001ff
#define I2C_SDA_HOLD_TIME_M  (I2C_SDA_HOLD_TIME_V << I2C_SDA_HOLD_TIME_S)
#define I2C_SDA_HOLD_TIME_V  0x000001ff
#define I2C_SDA_HOLD_TIME_S  0

/* I2C_SDA_SAMPLE_REG register
 * Configures the sample time after a positive SCL edge.
 */

#define I2C_SDA_SAMPLE_REG(i) (REG_I2C_BASE(i) + 0x34)

/* I2C_SDA_SAMPLE_TIME : R/W; bitpos: [8:0]; default: 0;
 * This register is used to configure for how long SDA is sampled, in I2C
 * module clock cycles.
 */

#define I2C_SDA_SAMPLE_TIME    0x000001ff
#define I2C_SDA_SAMPLE_TIME_M  (I2C_SDA_SAMPLE_TIME_V << I2C_SDA_SAMPLE_TIME_S)
#define I2C_SDA_SAMPLE_TIME_V  0x000001ff
#define I2C_SDA_SAMPLE_TIME_S  0

/* I2C_SCL_HIGH_PERIOD_REG register
 * Configures the high level width of SCL
 */

#define I2C_SCL_HIGH_PERIOD_REG(i) (REG_I2C_BASE(i) + 0x38)

/* I2C_SCL_WAIT_HIGH_PERIOD : R/W; bitpos: [15:9]; default: 0;
 * This register is used to configure for the SCL_FSM's waiting period for
 * SCL high level in master mode, in I2C module clock cycles.
 */

#define I2C_SCL_WAIT_HIGH_PERIOD    0x0000007f
#define I2C_SCL_WAIT_HIGH_PERIOD_M  (I2C_SCL_WAIT_HIGH_PERIOD_V << I2C_SCL_WAIT_HIGH_PERIOD_S)
#define I2C_SCL_WAIT_HIGH_PERIOD_V  0x0000007f
#define I2C_SCL_WAIT_HIGH_PERIOD_S  9

/* I2C_SCL_HIGH_PERIOD : R/W; bitpos: [8:0]; default: 0;
 * This register is used to configure for how long SCL remains high in
 * master mode, in I2C module clock cycles.
 */

#define I2C_SCL_HIGH_PERIOD    0x000001ff
#define I2C_SCL_HIGH_PERIOD_M  (I2C_SCL_HIGH_PERIOD_V << I2C_SCL_HIGH_PERIOD_S)
#define I2C_SCL_HIGH_PERIOD_V  0x000001ff
#define I2C_SCL_HIGH_PERIOD_S  0

/* I2C_SCL_START_HOLD_REG register
 * Configures the delay between the SDA and SCL negative edge for a start
 * condition
 */

#define I2C_SCL_START_HOLD_REG(i) (REG_I2C_BASE(i) + 0x40)

/* I2C_SCL_START_HOLD_TIME : R/W; bitpos: [8:0]; default: 8;
 * This register is used to configure the time between the negative edge
 * of SDA and the negative edge of SCL for a START condition, in I2C module
 * clock cycles.
 */

#define I2C_SCL_START_HOLD_TIME    0x000001ff
#define I2C_SCL_START_HOLD_TIME_M  (I2C_SCL_START_HOLD_TIME_V << I2C_SCL_START_HOLD_TIME_S)
#define I2C_SCL_START_HOLD_TIME_V  0x000001ff
#define I2C_SCL_START_HOLD_TIME_S  0

