apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_i2c.h
/* I2C_SCL_RSTART_SETUP_REG register
 * Configures the delay between the positive
 * edge of SCL and the negative edge of SDA
 */

#define I2C_SCL_RSTART_SETUP_REG(i) (REG_I2C_BASE(i) + 0x44)

/* I2C_SCL_RSTART_SETUP_TIME : R/W; bitpos: [8:0]; default: 8;
 * This register is used to configure the time between the positive
 * edge of SCL and the negative edge of SDA for a RESTART condition, in I2C
 * module clock cycles.
 */

#define I2C_SCL_RSTART_SETUP_TIME    0x000001ff
#define I2C_SCL_RSTART_SETUP_TIME_M  (I2C_SCL_RSTART_SETUP_TIME_V << I2C_SCL_RSTART_SETUP_TIME_S)
#define I2C_SCL_RSTART_SETUP_TIME_V  0x000001ff
#define I2C_SCL_RSTART_SETUP_TIME_S  0

/* I2C_SCL_STOP_HOLD_REG register
 * Configures the delay after the SCL clock
 * edge for a stop condition
 */

#define I2C_SCL_STOP_HOLD_REG(i) (REG_I2C_BASE(i) + 0x48)

/* I2C_SCL_STOP_HOLD_TIME : R/W; bitpos: [8:0]; default: 8;
 * This register is used to configure the delay after the STOP condition,
 * in I2C module clock cycles.
 */

#define I2C_SCL_STOP_HOLD_TIME    0x000001ff
#define I2C_SCL_STOP_HOLD_TIME_M  (I2C_SCL_STOP_HOLD_TIME_V << I2C_SCL_STOP_HOLD_TIME_S)
#define I2C_SCL_STOP_HOLD_TIME_V  0x000001ff
#define I2C_SCL_STOP_HOLD_TIME_S  0

/* I2C_SCL_STOP_SETUP_REG register
 * Configures the delay between the SDA and
 * SCL positive edge for a stop condition
 */

#define I2C_SCL_STOP_SETUP_REG(i) (REG_I2C_BASE(i) + 0x4c)

/* I2C_SCL_STOP_SETUP_TIME : R/W; bitpos: [8:0]; default: 8;
 * This register is used to configure the time between the positive edge
 * of SCL and the positive edge of SDA, in I2C module clock cycles.
 */

#define I2C_SCL_STOP_SETUP_TIME    0x000001ff
#define I2C_SCL_STOP_SETUP_TIME_M  (I2C_SCL_STOP_SETUP_TIME_V << I2C_SCL_STOP_SETUP_TIME_S)
#define I2C_SCL_STOP_SETUP_TIME_V  0x000001ff
#define I2C_SCL_STOP_SETUP_TIME_S  0

/* I2C_FILTER_CFG_REG register
 * SCL and SDA filter configuration register
 */

#define I2C_FILTER_CFG_REG(i) (REG_I2C_BASE(i) + 0x50)

/* I2C_SDA_FILTER_EN : R/W; bitpos: [9]; default: 1;
 * This is the filter enable bit for SDA.
 */

#define I2C_SDA_FILTER_EN    (BIT(9))
#define I2C_SDA_FILTER_EN_M  (I2C_SDA_FILTER_EN_V << I2C_SDA_FILTER_EN_S)
#define I2C_SDA_FILTER_EN_V  0x00000001
#define I2C_SDA_FILTER_EN_S  9

/* I2C_SCL_FILTER_EN : R/W; bitpos: [8]; default: 1;
 * This is the filter enable bit for SCL.
 */

#define I2C_SCL_FILTER_EN    (BIT(8))
#define I2C_SCL_FILTER_EN_M  (I2C_SCL_FILTER_EN_V << I2C_SCL_FILTER_EN_S)
#define I2C_SCL_FILTER_EN_V  0x00000001
#define I2C_SCL_FILTER_EN_S  8

/* I2C_SDA_FILTER_THRES : R/W; bitpos: [7:4]; default: 0;
 * When a pulse on the SDA input has smaller width than this register value
 * in I2C module clock cycles, the I2C controller will ignore that pulse.
 */

#define I2C_SDA_FILTER_THRES    0x0000000f
#define I2C_SDA_FILTER_THRES_M  (I2C_SDA_FILTER_THRES_V << I2C_SDA_FILTER_THRES_S)
#define I2C_SDA_FILTER_THRES_V  0x0000000f
#define I2C_SDA_FILTER_THRES_S  4

/* I2C_SCL_FILTER_THRES : R/W; bitpos: [3:0]; default: 0;
 * When a pulse on the SCL input has smaller width than this register value
 * in I2C module clock cycles, the I2C controller will ignore that pulse.
 */

#define I2C_SCL_FILTER_THRES    0x0000000f
#define I2C_SCL_FILTER_THRES_M  (I2C_SCL_FILTER_THRES_V << I2C_SCL_FILTER_THRES_S)
#define I2C_SCL_FILTER_THRES_V  0x0000000f
#define I2C_SCL_FILTER_THRES_S  0

/* I2C_CLK_CONF_REG register
 * I2C CLK configuration register
 */

#define I2C_CLK_CONF_REG(i) (REG_I2C_BASE(i) + 0x54)

/* I2C_SCLK_ACTIVE : R/W; bitpos: [21]; default: 1;
 * The clock switch for i2c module
 */

#define I2C_SCLK_ACTIVE    (BIT(21))
#define I2C_SCLK_ACTIVE_M  (I2C_SCLK_ACTIVE_V << I2C_SCLK_ACTIVE_S)
#define I2C_SCLK_ACTIVE_V  0x00000001
#define I2C_SCLK_ACTIVE_S  21

/* I2C_SCLK_SEL : R/W; bitpos: [20]; default: 0;
 * The clock selection for i2c module:0-XTAL;1-CLK_8MHz.
 */

#define I2C_SCLK_SEL    (BIT(20))
#define I2C_SCLK_SEL_M  (I2C_SCLK_SEL_V << I2C_SCLK_SEL_S)
#define I2C_SCLK_SEL_V  0x00000001
#define I2C_SCLK_SEL_S  20

/* I2C_SCLK_DIV_B : R/W; bitpos: [19:14]; default: 0;
 * the denominator of the fractional part of the fractional divisor for i2c
 * module
 */

#define I2C_SCLK_DIV_B    0x0000003f
#define I2C_SCLK_DIV_B_M  (I2C_SCLK_DIV_B_V << I2C_SCLK_DIV_B_S)
#define I2C_SCLK_DIV_B_V  0x0000003f
#define I2C_SCLK_DIV_B_S  14

/* I2C_SCLK_DIV_A : R/W; bitpos: [13:8]; default: 0;
 * the numerator of the fractional part of the fractional divisor for i2c
 * module
 */

#define I2C_SCLK_DIV_A    0x0000003f
#define I2C_SCLK_DIV_A_M  (I2C_SCLK_DIV_A_V << I2C_SCLK_DIV_A_S)
#define I2C_SCLK_DIV_A_V  0x0000003f
#define I2C_SCLK_DIV_A_S  8

/* I2C_SCLK_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 * the integral part of the fractional divisor for i2c module
 */

#define I2C_SCLK_DIV_NUM    0x000000ff
#define I2C_SCLK_DIV_NUM_M  (I2C_SCLK_DIV_NUM_V << I2C_SCLK_DIV_NUM_S)
#define I2C_SCLK_DIV_NUM_V  0x000000ff
#define I2C_SCLK_DIV_NUM_S  0

/* I2C_COMD0_REG register
 * I2C command register 0
 */

#define I2C_COMD0_REG(i) (REG_I2C_BASE(i) + 0x58)

/* I2C_COMMAND0_DONE : R/W/SS; bitpos: [31]; default: 0;
 * When command 0 is done in I2C Master mode, this bit changes to high
 * level.
 */

#define I2C_COMMAND0_DONE    (BIT(31))
#define I2C_COMMAND0_DONE_M  (I2C_COMMAND0_DONE_V << I2C_COMMAND0_DONE_S)
#define I2C_COMMAND0_DONE_V  0x00000001
#define I2C_COMMAND0_DONE_S  31

/* I2C_COMMAND0 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 0. It consists of three parts:
 * op_code is the command, 0: RSTART; 1: WRITE; 2: READ; 3: STOP; 4: END.
 * Byte_num represents the number of bytes that need to be sent or received.
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more
 * Information.
 */

#define I2C_COMMAND0    0x00003fff
#define I2C_COMMAND0_M  (I2C_COMMAND0_V << I2C_COMMAND0_S)
#define I2C_COMMAND0_V  0x00003fff
#define I2C_COMMAND0_S  0

/* I2C_COMD1_REG register
 * I2C command register 1
 */

#define I2C_COMD1_REG(i) (REG_I2C_BASE(i) + 0x5c)

