apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_i2c.h
/* I2C_COMMAND1_DONE : R/W/SS; bitpos: [31]; default: 0;
 * When command 1 is done in I2C Master mode, this bit changes to high
 * level.
 */

#define I2C_COMMAND1_DONE    (BIT(31))
#define I2C_COMMAND1_DONE_M  (I2C_COMMAND1_DONE_V << I2C_COMMAND1_DONE_S)
#define I2C_COMMAND1_DONE_V  0x00000001
#define I2C_COMMAND1_DONE_S  31

/* I2C_COMMAND1 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 1. It consists of three parts:
 * op_code is the command, 0: RSTART; 1: WRITE; 2: READ; 3: STOP; 4: END.
 * Byte_num represents the number of bytes that need to be sent or received.
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more
 * Information.
 */

#define I2C_COMMAND1    0x00003fff
#define I2C_COMMAND1_M  (I2C_COMMAND1_V << I2C_COMMAND1_S)
#define I2C_COMMAND1_V  0x00003fff
#define I2C_COMMAND1_S  0

/* I2C_COMD2_REG register
 * I2C command register 2
 */

#define I2C_COMD2_REG(i) (REG_I2C_BASE(i) + 0x60)

/* I2C_COMMAND2_DONE : R/W/SS; bitpos: [31]; default: 0;
 * When command 2 is done in I2C Master mode, this bit changes to high
 * Level.
 */

#define I2C_COMMAND2_DONE    (BIT(31))
#define I2C_COMMAND2_DONE_M  (I2C_COMMAND2_DONE_V << I2C_COMMAND2_DONE_S)
#define I2C_COMMAND2_DONE_V  0x00000001
#define I2C_COMMAND2_DONE_S  31

/* I2C_COMMAND2 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 2. It consists of three parts:
 * op_code is the command, 0: RSTART; 1: WRITE; 2: READ; 3: STOP; 4: END.
 * Byte_num represents the number of bytes that need to be sent or received.
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more
 * Information.
 */

#define I2C_COMMAND2    0x00003fff
#define I2C_COMMAND2_M  (I2C_COMMAND2_V << I2C_COMMAND2_S)
#define I2C_COMMAND2_V  0x00003fff
#define I2C_COMMAND2_S  0

/* I2C_COMD3_REG register
 * I2C command register 3
 */

#define I2C_COMD3_REG(i) (REG_I2C_BASE(i) + 0x64)

/* I2C_COMMAND3_DONE : R/W/SS; bitpos: [31]; default: 0;
 * When command 3 is done in I2C Master mode, this bit changes to high
 * level.
 */

#define I2C_COMMAND3_DONE    (BIT(31))
#define I2C_COMMAND3_DONE_M  (I2C_COMMAND3_DONE_V << I2C_COMMAND3_DONE_S)
#define I2C_COMMAND3_DONE_V  0x00000001
#define I2C_COMMAND3_DONE_S  31

/* I2C_COMMAND3 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 3. It consists of three parts:
 * op_code is the command, 0: RSTART; 1: WRITE; 2: READ; 3: STOP; 4: END.
 * Byte_num represents the number of bytes that need to be sent or received.
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more
 * Information.
 */

#define I2C_COMMAND3    0x00003fff
#define I2C_COMMAND3_M  (I2C_COMMAND3_V << I2C_COMMAND3_S)
#define I2C_COMMAND3_V  0x00003fff
#define I2C_COMMAND3_S  0

/* I2C_COMD4_REG register
 * I2C command register 4
 */

#define I2C_COMD4_REG(i) (REG_I2C_BASE(i) + 0x68)

/* I2C_COMMAND4_DONE : R/W/SS; bitpos: [31]; default: 0;
 * When command 4 is done in I2C Master mode, this bit changes to high
 * level.
 */

#define I2C_COMMAND4_DONE    (BIT(31))
#define I2C_COMMAND4_DONE_M  (I2C_COMMAND4_DONE_V << I2C_COMMAND4_DONE_S)
#define I2C_COMMAND4_DONE_V  0x00000001
#define I2C_COMMAND4_DONE_S  31

/* I2C_COMMAND4 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 4. It consists of three parts:
 * op_code is the command, 0: RSTART; 1: WRITE; 2: READ; 3: STOP; 4: END.
 * Byte_num represents the number of bytes that need to be sent or received.
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more
 * Information.
 */

#define I2C_COMMAND4    0x00003fff
#define I2C_COMMAND4_M  (I2C_COMMAND4_V << I2C_COMMAND4_S)
#define I2C_COMMAND4_V  0x00003fff
#define I2C_COMMAND4_S  0

/* I2C_COMD5_REG register
 * I2C command register 5
 */

#define I2C_COMD5_REG(i) (REG_I2C_BASE(i) + 0x6c)

/* I2C_COMMAND5_DONE : R/W/SS; bitpos: [31]; default: 0;
 * When command 5 is done in I2C Master mode, this bit changes to high level.
 */

#define I2C_COMMAND5_DONE    (BIT(31))
#define I2C_COMMAND5_DONE_M  (I2C_COMMAND5_DONE_V << I2C_COMMAND5_DONE_S)
#define I2C_COMMAND5_DONE_V  0x00000001
#define I2C_COMMAND5_DONE_S  31

/* I2C_COMMAND5 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 5. It consists of three parts:
 * op_code is the command, 0: RSTART; 1: WRITE; 2: READ; 3: STOP; 4: END.
 * Byte_num represents the number of bytes that need to be sent or received.
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more
 * Information.
 */

#define I2C_COMMAND5    0x00003fff
#define I2C_COMMAND5_M  (I2C_COMMAND5_V << I2C_COMMAND5_S)
#define I2C_COMMAND5_V  0x00003fff
#define I2C_COMMAND5_S  0

/* I2C_COMD6_REG register
 * I2C command register 6
 */

#define I2C_COMD6_REG(i) (REG_I2C_BASE(i) + 0x70)

/* I2C_COMMAND6_DONE : R/W/SS; bitpos: [31]; default: 0;
 * When command 6 is done in I2C Master mode, this bit changes to high level.
 */

#define I2C_COMMAND6_DONE    (BIT(31))
#define I2C_COMMAND6_DONE_M  (I2C_COMMAND6_DONE_V << I2C_COMMAND6_DONE_S)
#define I2C_COMMAND6_DONE_V  0x00000001
#define I2C_COMMAND6_DONE_S  31

/* I2C_COMMAND6 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 6. It consists of three parts:
 * op_code is the command, 0: RSTART; 1: WRITE; 2: READ; 3: STOP; 4: END.
 * Byte_num represents the number of bytes that need to be sent or received.
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more
 * Information.
 */

#define I2C_COMMAND6    0x00003fff
#define I2C_COMMAND6_M  (I2C_COMMAND6_V << I2C_COMMAND6_S)
#define I2C_COMMAND6_V  0x00003fff
#define I2C_COMMAND6_S  0

/* I2C_COMD7_REG register
 * I2C command register 7
 */

#define I2C_COMD7_REG(i) (REG_I2C_BASE(i) + 0x74)

/* I2C_COMMAND7_DONE : R/W/SS; bitpos: [31]; default: 0;
 * When command 7 is done in I2C Master mode, this bit changes to high level.
 */

#define I2C_COMMAND7_DONE    (BIT(31))
#define I2C_COMMAND7_DONE_M  (I2C_COMMAND7_DONE_V << I2C_COMMAND7_DONE_S)
#define I2C_COMMAND7_DONE_V  0x00000001
#define I2C_COMMAND7_DONE_S  31

