apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_i2c.h
/* I2C_COMMAND7 : R/W; bitpos: [13:0]; default: 0;
 * This is the content of command 7. It consists of three parts:
 * op_code is the command, 0: RSTART; 1: WRITE; 2: READ; 3: STOP; 4: END.
 * Byte_num represents the number of bytes that need to be sent or received.
 * ack_check_en, ack_exp and ack are used to control the ACK bit. See I2C
 * cmd structure for more
 * Information.
 */

#define I2C_COMMAND7    0x00003fff
#define I2C_COMMAND7_M  (I2C_COMMAND7_V << I2C_COMMAND7_S)
#define I2C_COMMAND7_V  0x00003fff
#define I2C_COMMAND7_S  0

/* I2C_SCL_ST_TIME_OUT_REG register
 * SCL status time out register
 */

#define I2C_SCL_ST_TIME_OUT_REG(i) (REG_I2C_BASE(i) + 0x78)

/* I2C_SCL_ST_TO_I2C : R/W; bitpos: [4:0]; default: 16;
 * The threshold value of SCL_FSM state unchanged period. It should be o
 * more than 23
 */

#define I2C_SCL_ST_TO_I2C    0x0000001f
#define I2C_SCL_ST_TO_I2C_M  (I2C_SCL_ST_TO_I2C_V << I2C_SCL_ST_TO_I2C_S)
#define I2C_SCL_ST_TO_I2C_V  0x0000001f
#define I2C_SCL_ST_TO_I2C_S  0

/* I2C_SCL_MAIN_ST_TIME_OUT_REG register
 * SCL main status time out register
 */

#define I2C_SCL_MAIN_ST_TIME_OUT_REG(i) (REG_I2C_BASE(i) + 0x7c)

/* I2C_SCL_MAIN_ST_TO_I2C : R/W; bitpos: [4:0]; default: 16;
 * The threshold value of SCL_MAIN_FSM state unchanged period.nIt should be
 * o more than 23
 */

#define I2C_SCL_MAIN_ST_TO_I2C    0x0000001f
#define I2C_SCL_MAIN_ST_TO_I2C_M  (I2C_SCL_MAIN_ST_TO_I2C_V << I2C_SCL_MAIN_ST_TO_I2C_S)
#define I2C_SCL_MAIN_ST_TO_I2C_V  0x0000001f
#define I2C_SCL_MAIN_ST_TO_I2C_S  0

/* I2C_SCL_SP_CONF_REG register
 * Power configuration register
 */

#define I2C_SCL_SP_CONF_REG(i) (REG_I2C_BASE(i) + 0x80)

/* I2C_SDA_PD_EN : R/W; bitpos: [7]; default: 0;
 * The power down enable bit for the I2C output SDA line. 1: Power down. 0:
 * Not power down. Set reg_sda_force_out and reg_sda_pd_en to 1 to stretch
 * SDA low.
 */

#define I2C_SDA_PD_EN    (BIT(7))
#define I2C_SDA_PD_EN_M  (I2C_SDA_PD_EN_V << I2C_SDA_PD_EN_S)
#define I2C_SDA_PD_EN_V  0x00000001
#define I2C_SDA_PD_EN_S  7

/* I2C_SCL_PD_EN : R/W; bitpos: [6]; default: 0;
 * The power down enable bit for the I2C output SCL line. 1: Power down. 0:
 * Not power down. Set reg_scl_force_out and reg_scl_pd_en to 1 to stretch
 * SCL low.
 */

#define I2C_SCL_PD_EN    (BIT(6))
#define I2C_SCL_PD_EN_M  (I2C_SCL_PD_EN_V << I2C_SCL_PD_EN_S)
#define I2C_SCL_PD_EN_V  0x00000001
#define I2C_SCL_PD_EN_S  6

/* I2C_SCL_RST_SLV_NUM : R/W; bitpos: [5:1]; default: 0;
 * Configure the pulses of SCL generated in I2C master mode. Valid when
 * reg_scl_rst_slv_en is 1.
 */

#define I2C_SCL_RST_SLV_NUM    0x0000001f
#define I2C_SCL_RST_SLV_NUM_M  (I2C_SCL_RST_SLV_NUM_V << I2C_SCL_RST_SLV_NUM_S)
#define I2C_SCL_RST_SLV_NUM_V  0x0000001f
#define I2C_SCL_RST_SLV_NUM_S  1

/* I2C_SCL_RST_SLV_EN : R/W/SC; bitpos: [0]; default: 0;
 * When I2C master is IDLE, set this bit to send out SCL pulses. The number
 * of pulses equals to reg_scl_rst_slv_num[4:0].
 */

#define I2C_SCL_RST_SLV_EN    (BIT(0))
#define I2C_SCL_RST_SLV_EN_M  (I2C_SCL_RST_SLV_EN_V << I2C_SCL_RST_SLV_EN_S)
#define I2C_SCL_RST_SLV_EN_V  0x00000001
#define I2C_SCL_RST_SLV_EN_S  0

/* I2C_SCL_STRETCH_CONF_REG register
 * Set SCL stretch of I2C slave
 */

#define I2C_SCL_STRETCH_CONF_REG(i) (REG_I2C_BASE(i) + 0x84)

/* I2C_SLAVE_BYTE_ACK_LVL : R/W; bitpos: [13]; default: 0;
 * Set the ACK level when slave controlling ACK level function enables.
 */

#define I2C_SLAVE_BYTE_ACK_LVL    (BIT(13))
#define I2C_SLAVE_BYTE_ACK_LVL_M  (I2C_SLAVE_BYTE_ACK_LVL_V << I2C_SLAVE_BYTE_ACK_LVL_S)
#define I2C_SLAVE_BYTE_ACK_LVL_V  0x00000001
#define I2C_SLAVE_BYTE_ACK_LVL_S  13

/* I2C_SLAVE_BYTE_ACK_CTL_EN : R/W; bitpos: [12]; default: 0;
 * The enable bit for slave to control ACK level function.
 */

#define I2C_SLAVE_BYTE_ACK_CTL_EN    (BIT(12))
#define I2C_SLAVE_BYTE_ACK_CTL_EN_M  (I2C_SLAVE_BYTE_ACK_CTL_EN_V << I2C_SLAVE_BYTE_ACK_CTL_EN_S)
#define I2C_SLAVE_BYTE_ACK_CTL_EN_V  0x00000001
#define I2C_SLAVE_BYTE_ACK_CTL_EN_S  12

/* I2C_SLAVE_SCL_STRETCH_CLR : WT; bitpos: [11]; default: 0;
 * Set this bit to clear the I2C slave SCL stretch function.
 */

#define I2C_SLAVE_SCL_STRETCH_CLR    (BIT(11))
#define I2C_SLAVE_SCL_STRETCH_CLR_M  (I2C_SLAVE_SCL_STRETCH_CLR_V << I2C_SLAVE_SCL_STRETCH_CLR_S)
#define I2C_SLAVE_SCL_STRETCH_CLR_V  0x00000001
#define I2C_SLAVE_SCL_STRETCH_CLR_S  11

/* I2C_SLAVE_SCL_STRETCH_EN : R/W; bitpos: [10]; default: 0;
 * The enable bit for slave SCL stretch function. 1: Enable. 0: Disable. The
 * SCL output line will be stretched low when reg_slave_scl_stretch_en is 1
 * and stretch event happens. The stretch cause can be seen in
 * reg_stretch_cause.
 */

#define I2C_SLAVE_SCL_STRETCH_EN    (BIT(10))
#define I2C_SLAVE_SCL_STRETCH_EN_M  (I2C_SLAVE_SCL_STRETCH_EN_V << I2C_SLAVE_SCL_STRETCH_EN_S)
#define I2C_SLAVE_SCL_STRETCH_EN_V  0x00000001
#define I2C_SLAVE_SCL_STRETCH_EN_S  10

/* I2C_STRETCH_PROTECT_NUM : R/W; bitpos: [9:0]; default: 0;
 * Configure the period of I2C slave stretching SCL line.
 */

#define I2C_STRETCH_PROTECT_NUM    0x000003ff
#define I2C_STRETCH_PROTECT_NUM_M  (I2C_STRETCH_PROTECT_NUM_V << I2C_STRETCH_PROTECT_NUM_S)
#define I2C_STRETCH_PROTECT_NUM_V  0x000003ff
#define I2C_STRETCH_PROTECT_NUM_S  0

/* I2C_DATE_REG register
 * Version register
 */

#define I2C_DATE_REG(i) (REG_I2C_BASE(i) + 0xf8)

/* I2C_DATE : R/W; bitpos: [31:0]; default: 537330177;
 * This is the version register.
 */

#define I2C_DATE    0xffffffff
#define I2C_DATE_M  (I2C_DATE_V << I2C_DATE_S)
#define I2C_DATE_V  0xffffffff
#define I2C_DATE_S  0

/* I2C_TXFIFO_START_ADDR_REG register
 * I2C TXFIFO base address register
 */

#define I2C_TXFIFO_START_ADDR_REG(i) (REG_I2C_BASE(i) + 0x100)

/* I2C_TXFIFO_START_ADDR : RO; bitpos: [31:0]; default: 0;
 * This is the I2C txfifo first address.
 */

#define I2C_TXFIFO_START_ADDR    0xffffffff
#define I2C_TXFIFO_START_ADDR_M  (I2C_TXFIFO_START_ADDR_V << I2C_TXFIFO_START_ADDR_S)
#define I2C_TXFIFO_START_ADDR_V  0xffffffff
#define I2C_TXFIFO_START_ADDR_S  0

/* I2C_RXFIFO_START_ADDR_REG register
 * I2C RXFIFO base address register
 */

#define I2C_RXFIFO_START_ADDR_REG(i) (REG_I2C_BASE(i) + 0x180)

/* I2C_RXFIFO_START_ADDR : RO; bitpos: [31:0]; default: 0;
 * This is the I2C rxfifo first address.
 */

#define I2C_RXFIFO_START_ADDR    0xffffffff
#define I2C_RXFIFO_START_ADDR_M  (I2C_RXFIFO_START_ADDR_V << I2C_RXFIFO_START_ADDR_S)
#define I2C_RXFIFO_START_ADDR_V  0xffffffff
#define I2C_RXFIFO_START_ADDR_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_I2C_H */
